[
  {
    "rId": 1,
    "rTitle": "Kurzbericht zur Tagung Mensch und Computer 2014 in München",
    "rAuthor": "Koch, Michael",
    "rYear": 2014,
    "rShort": "Spannendes Abstract",
    "rFull": "Schon zum vierzehnten Mal fand Anfang September, diesmal in München, die Ta-gung Mensch und Computer statt. Ein-geladen vom Fachbereich Mensch-Com-puter-Interaktion und dem Berufsverband der Deutschen Usability und User Experi-ence Professionals sowie den drei ausrich-tenden Münchner Universitäten fanden 769 Teilnehmer den Weg zur Tagung. Zur offiziellen Eröffnung am Montag durften wir  neben  der  Präsidentin  der  German  UPA,  Frau  Kostanija  Petrovic,  auch  den  Präsidenten der Gesellschaft für Informa-tik, Herrn Prof. Dr.-Ing. Peter Liggesmay-er, begrüßen.Die  Mensch  und  Computer  ist  eine  vom Fachbereich Mensch-Computer-In-teraktion der Gesellschaft für Informatik (GI) initiierte und seit 2001 jährlich statt-findende Fachtagungsreihe zu Mensch-Computer-Interaktion.  Hier  treffen  sich  Personen  aus  Wissenschaft  und  Praxis,  um  neueste  Forschungsergebnisse  zu  diskutieren, Erfahrungen auszutauschen und neue Produkte und Methoden ken-nen zu lernen. Die Tagung bietet Einbli-cke  in  Entwicklungen  in  den  Bereichen  Usability, User Experience, Mensch-Com-puter-Interaktion,  Computer-Supported  Cooperative Work und Gestaltung inter-aktiver Medien."
  },
  {
    "rId": 2,
    "rTitle": "Benutzergesteuerter Datenschutz in Grids",
    "rAuthor": "Hommel, Wolfgang; Schiffers, Michael",
    "rYear": 2021,
    "rShort": "Grid Computing erlaubt die aus Benutzersicht weitgehend transparente, verteilte Nutzung von Ressourcen und unterscheidet sich durch Konzepte wie Virtuelle Organisationen zum Teil stark von herkömmlichen verteilten Systemen. Die sich daraus ergebenden Grid-spezifischen Anforderungen an den Datenschutz und die Datensicherheit wurden von Lösungsansätzen, die beispielsweise im Bereich des Federated Identity Management bereits erfolgreich eingesetzt werden, bislang nur unzureichend erfüllt. In diesem Beitrag werden zuerst die aus Datenschutzperspektive wichtigsten Unterschiede zwischen Grids und herkömmlichen föderierten Umgebungen dargelegt und sich daraus ergebende neue Anforderungen diskutiert. Anschließend wird gezeigt, wie bestehende Privacy Management Ansätze erweitert werden können, um Grid- spezifische Datenschutzanforderungen zu erfüllen. Der Schwerpunkt liegt dabei auf den Steuerungs- und Kontrollmechanismen, die den Grid-Benutzern eingeräumt werden. Aufbauend auf einer policybasierten Privacy Management Infrastruktur, die wir in einer früheren Arbeit präsentiert haben, werden die Anwendung der vorgestellten Methodik am Beispiel der standardisierten Policysprache XACML konkret demonstriert und die Integration der notwendigen Komponenten in Grid-Architekturen diskutiert.",
    "rFull": "Grid Computing erm ̈oglicht die transparente, Organisationen ̈ubergreifende Nutzung von\nRessourcen (meist in Form von Rechen- und Speicherkapazität ̈aten) auf der Basis entspre-\nchender Middleware-Technologien. An aktuellen Grid-Projekten wie dem deutschen D-\nGrid [NKH07] sind als Ressourcenanbieter prim ̈ar H ̈ochstleistungsrechenzentren beteiligt;\nsie stellen Systeme f ̈ur wissenschaftliche Anwendungen zur Verf ̈ugung, um sehr umfang-\nreiche Berechnungen mit großen Datenvolumina effizient durchf ̈uhren zu k ̈onnen.\nAbbildung 1 zeigt den maßgeblichen Ablauf aus Benutzerperspektive: Eine der am Grid be-\nbeteiligte Organisationen als Heimatorganisation des Benutzers; dieser erh ̈alt dort\ndie M̈oglichkeit, so genannte Grid-Jobs in Auftrag zu geben, wof ̈ur entweder kommando-\nzeilenorientierte Werkzeuge oder Grid-Webportale zur Verf ̈ugung stehen. Da Grid-Dienste prim ̈ar nicht anonym oder pseudonym nutzbar sind\nsind, spielt der Schutz personenbezogener Daten eine sehr wichtige Rolle. Aufgrund der\nhistorische und zum Teil sehr kernfunktional orientierte Entwicklung der Middleware-\nProdukte setzt sich das Bewusstsein für Datenschutz und Datensicherheit in Grids jedoch\nerst nach und nach durch; bisher stehen keine technischen L ̈osungen zur Verf ̈ugung, die\npraktisch eingesetzt werden können.\nAus technischer Perspektive m ̈ussen beim Datenschutz in Grids – wie bei anderen or-\nganisations ̈übergreifend genutzten Diensten – zwei Phasen unterschieden werden: In ei-\nnem ersten Schritt entschieden werden müssen, welche personenbezogenen Daten einer am\nGrid beteiligten Organisation ̈uberhaupt zug ̈anglich gemacht werden d ̈urfen; in der sich\nanschließenden Betriebsphase muss sichergestellt werden, dass diese Daten nur zweck-\ngebunden used und den Vereinbarungen gem ̈aß wieder gel ̈oscht werden. in beiden\nm ̈ussen neben gesetzlichen Auflagen auch Gridsowie organisationsweite Verein-\nbarungen und insbesondere auch benutzerspezifische Vorgaben ber ̈ucksichtigt Werden.\nIn den Bereichen des Enterprise Identity & Access Managements sowie des Federated\nIdentity Managements wurden sowohl von der Forschung als auch von der Industrie L ̈o-\nsungen für das Privacy Management erarbeitet, die sich jedoch nur bedingt auf Grids an-\nwenden lassen. Zum einen Fokussieren sie auf den Schutz der personenbezogenen Daten\nten des Benutzers selbst, nachl ̈assigen jedoch den Schutz Grid-anwendungsspezifischer\nDaten – beispielsweise umfangreicher Patientendatens ̈atze, die als Eingabe von Grid-An-\nwendungen dienen. Zum anderen konnten Grid-Konzepte wie die Sichten Virtueller Orga-\nnisationen (VOs) auf this Daten technisch nur rudiment ̈ar abgebildet Werden"
  }
]
